Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཅི་མདང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ། རྒྱལ་པོ་ཆེན་པོ་བཞི་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འོངས་སམ་སྙམ་ནས
en: “What was this? Last night, did Sahāṃpati Brahmā, or Śakra, King of the Gods—or perhaps the four great kings—come to offer respect to the Blessed One?”

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: They went to the Blessed One, and when they arrived, they touched their heads to his feet, and asked him,

source: བཙུན་པ་འདི་ན་བདག་ཅག་དགེ་སློང་མང་པོ་སྲོད་དང་ཐོ་རངས་མི་ཉལ་བར་བརྩོན་པ་ལྷུར་བགྱིད་པ་ལ་གནས་པ་རྣམས་ཀྱིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་མཐོང་ལགས་ན་བཙུན་པ་ཅི་ལགས།
en: “Lord, we monks were maintaining our strict effort not to sleep at dusk and dawn, and we noticed many great rays of light spreading forth from the garden of Prince Jeta. Lord, what was this?

source: མདང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ་རྒྱལ་པོ་ཆེན་པོ་བཞི་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་སླད་དུ་མཆིས་ལགས་སམ།
en: Last night, did Sahāṃpati Brahmā, or Śakra, King of the Gods—or perhaps the four great kings—come to offer respect to the Blessed One?”

source: དགེ་སློང་དག་མདང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ་རྒྱལ་པོ་ཆེན་པོ་བཞི་ང་ལ་བལྟ་བའི་ཕྱིར་འོངས་པ་མ་ཡིན་ཏེ
en: “Monks, last night it was neither Sahāṃpati Brahmā, nor Śakra, King of the Gods, nor the four great kings who came to see me.

source: བ་ལང་རྫི་མོ་གང་གིས་ཀོ་ཤ་ཏ་ཀའི་མེ་ཏོག་གིས་ང་ལ་མཆོད་དེ་ངའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། ང་ལས་ཆོས་ཐོས་ཏེ་སོང་བ་གང་ཡིན་པ་དེ་ཁྱོད་ཀྱིས་མཐོང་ངམ།
en: Did you see the cowherd who offered me worship with kośataka flowers, touched her head to my feet, heard the Dharma from me, and departed?”

source: དེ་ནི་སོང་ནས་རིང་པོར་མ་ལོན་པར་ང་ལ་སེམས་དགའ་བཞིན་དུ་ཤི་འཕོས་ཏེ།
en: “Not long after she left, filled with joy at the thought of me, she died, transmigrated, and took rebirth as a god in the realm of the gods.

source: དུས་ལས་འདས་ནས་ལྷ་ཡུལ་དུ་སྐྱེས་ཏེ་ལྷ་མོར་གྱུར་ནས་ངའི་ཐད་དུ་འོངས་པ་དེ་ལ་ངས་ཆོས་བསྟན་ཏེ།
en: Then she came here to see me and I taught the Dharma to her.

source: དེས་ང་ལས་ཆོས་ཐོས་ནས་བདེན་པ་མཐོང་སྟེ་བདེན་པ་མཐོང་ནས་རང་གི་གནས་སུ་སོང་ངོ་། །
en: Hearing the Dharma from me, she saw the truths, and having seen the truths, she went back to where she belongs.”

source: བཙུན་པ་བ་ལང་རྫི་མོ་དེས་ལས་ཅི་བགྱིས་ན་ལས་དེས་བ་ལང་རྫི་དབུལ་པོའི་རིགས་སུ་སྐྱེས་ལགས།
en: “Lord, what action did this cowherd take that ripened into her birth into a family of poor cowherds?

source: ལས་ཅི་བགྱིས་ན་འདི་ནས་ཤི་འཕོས་ཏེ་ལྷའི་ཡུལ་དུ་སྐྱེས་ལགས།
en: What action did she take that after she died, she transmigrated and took rebirth in the realm of the gods?

source: ལས་གང་གིས་ནི་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེམི་མཉེས་པར་མ་བགྱིས་ལགས།
en: What action pleased the Blessed One, and did not displease him?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདས་པའི་ལས་ཀྱི་ཤས་ཀྱང་ཡོད་དོ། །
en: “Monks, it was partly her past actions, [and it is partly her present actions as well,]” the Blessed One replied.

source: ད་ལྟར་བྱུང་བའི་ལས་ཀྱི་ཤས་ཀྱང་ཡོད་དོ། །
en: “Monks, [it was partly her past actions, and] it is partly her present actions as well,” the Blessed One replied.

source: འདས་པའི་ལས་ཅི་བགྱིས་ལགས།
en: “What actions did she commit in the past?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཡར་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་སྟེ། དགེ་སློང་མར་གྱུར་པ་ན་འཐབ་ཀྲོལ་ཅན་ཁ་ཚས་ངན་པར་གྱུར་ཏེ་ཁྲོས་ནས།
en: “After she went forth in the doctrine of the totally and completely enlightened Buddha Kāśyapa and became a nun,” recounted the Blessed One, “she became quarrelsome and abusive.

source: དགེ་སློང་མ་མང་པོ་ཞིག་ལ་བ་ལང་རྫི་མོ་ཞེས་བྱ་བའི་ཚིག་སྨྲས་ནས།
en: In anger she spoke harshly to a group of nuns, calling them cowherds.

source: དེ་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་འགྱོད་པ་སྐྱེས་ཏེ་སྨོན་ལམ་བཏབ་པ།
en: “Then after practicing pure conduct all her life, at the time of her death she felt regret, and prayed,

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས།
en: ‘While I may not have attained any great virtues, still I have gone forth like this in the doctrine of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all my life.

source: བདག་གིས་དགེ་སློང་མ་རྣམས་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་ལས་དེའི་འབྲས་བུ་བདག་ལ་རྣམ་པར་སྨིན་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May I not meet with the results of the wrongful act of speaking harshly to fellow practitioners of the holy life.’

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས་དེའི་ཚེ་དགེ་སློང་མར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བ་ལང་རྫི་མོ་དེ་ཉིད་ཡིན་ཏེ།
en: “O monks, what do you think? The one who was that nun then is now this selfsame cowherd.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: ‘May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.’

source: འདིས་ང་མཉེས་པར་བྱས་ཏེམི་མཉེས་པར་མ་བྱས་པ་འདི་ནི་འདས་པའི་ལས་ཡིན་ནོ། །
en: that she has pleased me and not displeased me.

source: ད་ལྟར་བྱུང་བའི་ལས་གང་ཞེ་ན།
en: These were her past actions.

source: བ་ལང་རྫི་མོར་གྱུར་པ་དེས་ཀོ་ཤ་ཏ་ཀའི་མེ་ཏོག་གིས་ང་ལ་མཆོད་པ་བྱས་པ་དང་ང་ལ་སེམས་དགའ་བར་གྱུར་པ་དེས་ནི་ལྷ་ཡུལ་དུ་སྐྱེས་ཏེ།
en: “As for her present actions, the one who became that cowherd offered me worship with kośataka flowers, felt joy toward me, and took rebirth in the realm of the gods.

source: དགེ་སློང་དག་འདི་ནི་ད་ལྟར་བྱུང་བའི་ལས་ཡིན་ནོ། །
en: Monks, these are her present actions.”

source: བཙུན་པ་བ་ལང་རྫི་འདི་རྣམས་ཀྱིས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་བ་ལང་རྫི་དབུལ་པོའི་རིགས་སུ་སྐྱེས་ལགས།
en: “Lord, what action did the other cowherds commit that ripened into their births into families of poor cowherds?

source: ལས་ཅི་བགྱིས་ན་ལས་དེས་འདི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལ།
en: What action did they take that ripened into their pleasing the Blessed One, not displeasing him,

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: going forth in the doctrine of the Blessed One, casting away all afflictive emotions, and manifesting arhatship?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བྱུང་སྟེ
en: “After they went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa,” recounted the Blessed One,

source: དགེ་སློང་འཐབ་ཀྲོལ་ཅན་ཁ་ཚས་ངན་པར་གྱུར་ནས།
en: “they became quarrelsome and abusive.

source: དེར་དེ་དག་ཁྲོས་ནས་དགེ་སློང་མང་པོ་ཞིག་ལ་བ་ལང་རྫི་ཞེས་བྱ་བའི་ཚིག་སྨྲས་ལ།
en: In anger they spoke harshly to the other monks, calling them cowherds.

source: དེར་དེ་དག་གིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: Then they practiced pure conduct all their lives, and at the time of their deaths, they prayed,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་ཅག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘May we please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: བདག་ཅག་གིས་དགེ་སློང་མང་པོ་ལ་བ་ལང་རྫི་ཞེས་བྱ་བའི་ཚིག་སྨྲས་པའི་ལས་དེའི་འབྲས་བུ་བདག་ཅག་ལ་སྨིན་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: And may we not meet with the results of the act of speaking harshly to those monks.’

source: དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་ལྔ་བརྒྱར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་བ་ལང་རྫི་ལས་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་ལྔ་བརྒྱ་པོ་འདི་རྣམས་ཡིན་ཏེ
en: The five hundred monks who went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa then are none other than these five hundred monks who gave up cowherding to go forth.

source: དེ་དག་གིས་དེར་རབ་ཏུ་བྱུང་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: At that time, after they went forth, at the time of their deaths they prayed,

source: འདི་རྣམས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: that they have pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: དེར་དེ་དག་ཁྲོས་པས་དགེ་སློང་མང་པོ་ལ་བ་ལང་རྫི་ཞེས་བྱ་བའི་ཚིག་སྨྲས་པ་དང་སྦྱིན་པ་ཡང་མ་བྱིན་པ་དེས་ནི་
en: At that time, in anger they spoke harshly to the other monks, calling them cowherds, and they also failed to give gifts.

source: བ་ལང་རྫི་དབུལ་པོ་གཞན་གྱི་ཚལ་ཟ་བར་བྱེད་པས་འཚོ་བར་གྱུར་ཏོ།། །།
en: So it is that they became poor cowherds, subsisting on the food of others.”

source: མཛའ་སྡེ་རྣམས་ཞེས་བྱ་བ་ནི།
en: A Band of Friends

source: དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་མཛའ་སྡེ་བོ་ལྔ་བརྒྱ་ཙམ་འཁོད་པ་རྣམས།
en: When the Blessed One was in Śrāvastī, there lived a band of five hundred friends.

source: དུས་དུས་སུ་མེ་ཏོག་གང་རྒྱས་པར་དེ་དག་ལོངས་སྤྱད་པའི་ཕྱིར་སྐྱེད་མོས་ཚལ་གྱི་ནང་དུ་སོང་ནས་རོལ་མོ་བྱེད་དེརྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: From time to time when the flowers were blooming, they would walk into the gardens for fun playing music, enjoying themselves, and coupling.

source: དེ་ནས་ཕྱི་ཞིག་ན་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་རྣམས་རྒྱས་པར་གྱུར་ནས། དེ་དག་ལོངས་སྤྱད་པར་བྱ་བའི་ཕྱིར་དེ་དག་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ཏེ།
en: Then one day, as the lotus, blue lotus, white water lily, and white lotus flowers were in bloom, to have some fun they clad themselves in every type of adornment;

source: མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་རྣམས་ཀྱིས་ཕྲེང་བ་དང་།
en: took up garlands of lotus, blue lotus, white water lily, and white lotus flowers;

source: ཐོད་དང་། རྣ་རྒྱན་དང་། ཆུན་པོ་རྣམས་རྒྱན་དུ་ཐོགས་ཤིང་ཨུད་པ་ལ་ཆང་པ་རེ་རེ་ཐོགས་ནསསིལ་སྙན་སྣ་ཚོགས་དང་། ཕེག་རྡོབ་ཅིང་མཉན་དུ་ཡོད་པ་ནས་བྱུང་སྟེ། སྐྱེད་མོས་ཚལ་གྱི་ནང་དུ་ཆས་སོ། །
en: festooned themselves with hats, earrings, and flower arrangements; and, each carrying an arrangement of blue lotuses, left Śrāvastī, and walked to the gardens with a flourish of cymbals.

source: བཅོམ་ལྡན་འདས་ཀྱང་དེ་དག་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ།
en: The Blessed One had come to the region purely out of compassion for them,

source: ལྷུང་བཟེད་བསྣམས་ནས་མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་གཤེགས་པ་དང་།
en: and in the morning he donned his lower garment and Dharma robes, and, carrying his alms bowl, went for alms in Śrāvastī.

source: མཛའ་སྡེ་བོ་དེ་དག་གིས་ཐག་རིང་པོ་ཞིག་ནས།
en: The band of friends saw him from a distance.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ།
en: His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire,

source: མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ། མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ། མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ།
en: like flames stoked with ghee, like a lamp set in a golden vessel, and like a pillar adorned with all manner of jewels.

source: མཐོང་ནས་ཀྱང་དེ་དག་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བ་སྐྱེས་སོ། །
en: When they saw the Blessed Buddha the sight of him filled them with supreme joy.

source: དགའ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Full of such joy, they approached him, touched their heads to the Blessed One’s feet,

source: བཅོམ་ལྡན་འདས་ལ་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་རྣམས་ཀྱིས་གཏོར་ནས།
en: scattered lotus, blue lotus, white water lily, and white lotus flowers over him,

source: སིལ་སྙན་དང་། ཕེག་རྡོབ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་དོང་ངོ་། །
en: struck the cymbals, then circumambulated him three times and departed.

source: དེའི་སྐབས་སུ་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་དེ།
en: At that moment the Blessed One smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ་འཛུམ་པ་མཛད་པའི་ཆོས་ཉིད་དེ། དེའི་ཚེ་ཞལ་ནས་འོད་ཟེར་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་རྣམས་བྱུང་ནས། ཁ་ཅིག་ནི་འོག་ཏུ་འགྲོའོ། །ཁ་ཅིག་ནི་སྟེང་དུ་འགྲོའོ། །
en: Now it is the nature of the blessed buddhas’ smiles that when they smile, colorful beams of blue, yellow, red, and white light radiate from their mouths , with some traveling up and others traveling down.

source: འོག་ཏུ་འགྲོ་བ་གང་ཡིན་པ་དེ་དག་ནི་སེམས་ཅན་དམྱལ་བ་ཡང་སོས་དང་། ཐིག་ནག་དང་། བསྡུས་འཇོམས་དང་། ངུ་འབོད་དང་། ངུ་འབོད་ཆེན་པོ་དང་། ཚ་བ་དང་། རབ་ཏུ་ཚ་བ་དང་། མནར་མེད་པ་དང་། ཆུ་བུར་ཅན་དང་། ཆུ་བུར་རྡོལ་དང་། སོ་ཐམས་ཐམས་དང་། ཀྱི་ཧུད་ཟེར་བ་དང་། ཨ་ཆུ་ཟེར་བ་དང་། ཨུད་པ་ལ་ལྟར་གས་པ་དང་། པད་མ་ལྟར་གས་པ་དང་། པད་མ་ལྟར་གས་པ་ཆེན་པོར་སོང་ནས
en: Those that travel down go to the beings in the Reviving Hell, the Black Thread Hell , the Crushing Hell, the Shrieking Hell, the Screaming Hell, the Hot Hell, the Hell of Extreme Heat, the Hell of Ceaseless Agony, the Blistering Hell, the Bursting Blister Hell, the Hell of Chattering Teeth, the Hell of Lamentation, the Cold Whimpering Hell, the Splitting Open Like a Blue Lotus Hell, the Splitting Open Like a Lotus Hell, and the Splitting Open Like a Great Lotus Hell,

source: དེས་ན་སེམས་ཅན་དེ་དག་གི་གནོད་པའི་ཁྱད་པར་རྣམས་རྩེ་ཞིལ་བར་གྱུར་ཏོ། །དེ་ནས་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: In this way they soothe the particular injuries of those beings, who wonder,

source: དེ་ནས་དེ་དག་དད་པ་སྐྱེད་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་སྤྲུལ་པ་འགྱེད་པར་མཛད་དེ། དེ་དག་གིས་སྤྲུལ་པ་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then, to engender faith in them, the blessed ones radiate an emanation, and when the beings see it, they think,

source: ཀྱེ་བདག་ཅག་ནི་འདི་ནས་ཀྱང་ཤི་འཕོས་པར་མ་གྱུར་ལ། གཞན་དུ་ཡང་མ་སྐྱེས་མོད་ཀྱི་འོན་ཀྱང་སྔོན་མ་བྱུང་བའི་སེམས་ཅན་སྣང་བ་འདིའི་མཐུས། བདག་ཅག་གི་གནོད་པའི་ཁྱད་པར་རྣམས་རྩེ་ཞིལ་བར་གྱུར་ཏོ་སྙམ་མོ། །
en: “Alas, it is neither that we have died and left this place, nor that we have been born elsewhere. Rather it is because of the unprecedented appearance of this emanation that our particular injuries have been soothed.”

source: དེ་ནས་དེ་དག་སྤྲུལ་པ་དེ་ལ་སེམས་མངོན་པར་དགའ་བར་གྱུར་ནས། སེམས་ཅན་དམྱལ་བ་མྱོང་བར་འགྱུར་བའི་ལས་དེ་ཟད་དེ་
en: They feel real joy toward the emanation, exhausting the deeds that brought them to experience the hells.

source: ལྷ་དང་། མི་རྣམས་ཀྱི་ནང་དུ་གང་དུ་བདེན་པ་རྣམས་ཀྱི་སྣོད་དུ་རུང་བར་འགྱུར་བ་དེར་ཉིང་མཚམས་འཛིན་པར་འགྱུར་རོ། །
en: Now, as fit vessels of the truths, they take rebirth among the gods and humans.

source: སྟེང་དུ་འགྲོ་བ་གང་ཡིན་པ་དེ་དག་ནི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། སུམ་ཅུ་རྩ་གསུམ་པ་རྣམས་དང་། འཐབ་བྲལ་རྣམས་དང་། དགའ་ལྡན་རྣམས་དང་། འཕྲུལ་དགའ་རྣམས་དང་། གཞན་འཕྲུལ་དབང་བྱེད་རྣམས་དང་། ཚངས་རིས་རྣམས་དང་། ཚངས་པའི་མདུན་ན་འདོན་པ་རྣམས་དང་། ཚངས་པ་ཆེན་པོ་རྣམས་དང་། འོད་ཆུང་རྣམས་དང་ཚད་མེད་འོད་རྣམས་དང་། འོད་གསལ་རྣམས་དང་། དགེ་ཆུང་རྣམས་དང་། ཚད་མེད་དགེ་རྣམས་དང་། དགེ་རྒྱས་རྣམས་དང་། སྤྲིན་མེད་རྣམས་དང་། བསོད་ནམས་སྐྱེས་རྣམས་དང་། འབྲས་བུ་ཆེ་རྣམས་དང་། མི་ཆེ་རྣམས་དང་། མི་གདུང་རྣམས་དང་། གྱ་ནོམ་སྣང་རྣམས་དང་། ཤིན་ཏུ་མཐོང་རྣམས་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་བར་དུ་སོང་ནས་
en: The rays of light that travel up go to the following gods: those of the Abodes of the Four Great Kings, the Heaven of the Thirty-Three, the Strifeless Heaven, Tuṣita Heaven, the Delighting in Creation Heaven, the Heaven of the Masters of Others’ Creations, and the Heaven of Brahmā’s Assembly; those of the realms called Brahmin Priests, Great Brahmā, Limited Splendor, Immeasurable Splendor, Radiant Heaven, Lesser Virtue, Immeasurable Virtue, Extensive Virtue, and the Cloudless Heaven; and those of the realms called Increasing Merit, Great Result , None Greater, Sorrowless, Sublime Vision, Great Vision, and Supreme .

source: ངེས་པར་འབྱུང་བ་བརྩམ་པར་གྱིས། །སངས་རྒྱས་བསྟན་ལ་སྦྱོར་བར་གྱིས། །འདམ་བུའི་ཁྱིམ་ལ་གླང་ཆེན་བཞིན། །འཆི་བདག་སྡེ་ནི་གཞོམ་པར་གྱིས། །
en: Cultivate renunciation, Practice the Buddha’s teaching— Trample the lord of death’s army Like an elephant in a house of reeds!

source: གང་ཞིག་ཆོས་འདུལ་འདི་ཉིད་ལ། །བག་ཡོད་སྤྱོད་པར་བྱེད་པ་ནི། །སྐྱེ་བའི་འཁོར་བ་རབ་སྤངས་ནསསྡུག་བསྔལ་ཟད་པར་བྱེད་པར་འགྱུར། །
en: Those who mind their way along the path Of this Dharma and Vinaya Will abandon the round of rebirth And put an end to suffering.

source: ཡང་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: He then supplicated him with the following verses:

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་མཛའ་སྡེ་བོ་འདི་དག་གིས་ང་ལ་འདི་ལྟ་བུའི་བཀུར་སྟི་བྱས་པ་མཐོང་ངམ།
en: Ānanda, did you see the band of friends who were venerating me?”

source: ཀུན་དགའ་བོ་མཛའ་སྡེ་བོ་འདི་དག་དགེ་བའི་རྩ་བ་དང་སེམས་བསྐྱེད་པ་དང་སྦྱིན་པར་བྱ་བའི་ཆོས་ཡོངས་སུ་གཏོང་བ་འདིས། བསྐལ་པ་བཅུ་གསུམ་གྱི་བར་དུ་ལོག་པར་ལྟུང་བར་མི་འགྱུར་ཏེ
en: “Ānanda, because of their roots of virtue, their states of mind, and the wholeheartedness of their generosity, they will not fall to the lower realms for thirteen eons.

source: བསྐལ་པ་བཅུ་གསུམ་གྱི་བར་དུ་ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་ཉིང་མཚམས་སྦྱོར་ཞིང་འཁོར་བར་གྱུར་ནས། སྲིད་པ་ཐ་མ་དང་། གནས་ཐ་མ་ལ་མིར་སྐྱེ་བ་ཐོབ་ནས།
en: For thirteen eons they will take rebirth among gods and humans. After circling in saṃsāra, in their final rebirth, their final dwelling place, they will take birth as human beings.

source: རབ་ཏུ་བྱུང་སྟེ་སློབ་དཔོན་མེད་པ་དང་། ལུང་མེད་པར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་འཐུན་པའི་ཆོས་སུམ་ཅུ་རྩ་བདུན་མངོན་དུ་བྱས་ནས།
en: Then they will go forth and manifest the thirty-seven wings of enlightenment without a teacher or any instruction.

source: རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ཏེ། ཐམས་ཅད་ཀྱང་རང་སངས་རྒྱས་སྨོན་པ་མེད་པ་ཞེས་བྱ་བ་ཤ་སྟག་ཏུ་འགྱུར་ཏེ།
en: They will manifest the enlightenment of a solitary buddha and become the solitary buddhas known as The Wishless Ones.

source: འདི་ནི་དེ་དག་གི་སྦྱིན་པར་བྱ་བའི་ཆོས་ཡིན་ནོ། །
en: That is what shall come of their act of generosity.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྲིན་ལས་ཅི་མཛད་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་མཛའ་སྡེ་བོ་ལྔ་བརྒྱས་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དག་གིས་འདི་ལྟར་བཀུར་སྟི་བགྱིས་ལགས།
en: “Lord, what wondrous actions did the Blessed One perform that ripened into the band of five hundred friends venerating him with lotus, blue lotus, white water lily, and white lotus flowers?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་ལས་དེ་ལྟ་བུ་བྱས་ཤིང་བསགས་ཏེ
en: “Monks,” replied the Blessed One, “the Tathāgata committed and accumulated the actions himself at a previous time.

source: དགེ་སློང་དག་ལས་བྱས་ཤིང་བསགས་པ་རྣམས་ནི་ཕྱི་རོལ་གྱི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར།
en: The actions I committed and accumulated did not ripen into the element of earth.

source: ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར་ཏེ།
en: They did not ripen into the external element of water, nor the element of fire, nor the element of wind.

source: ལས་དགེ་བ་དང་མི་དགེ་བ་བྱས་ཤིང་བསགས་པ་རྣམས་ནི་ཟིན་པའི་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་འབའ་ཞིག་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་རོ། །
en: The actions I committed and accumulated, both virtuous and nonvirtuous, ripened into nothing but my own aggregates, sense bases, and constituent elements.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་གྲངས་མེད་པ་གཉིས་ལ་བབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་མར་མེ་མཛད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “Monks, in times gone by, two incalculable eons ago, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Dīpaṃkara was in the world.

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ལས། རྒྱལ་པོའི་ཕོ་བྲང་མར་མེ་ལྡན་ཞེས་བྱ་བར་བྱོན་ཏོ། །
en: “One day as the totally and completely awakened Buddha Dīpaṃkara was traveling through the countryside, he came to the royal palace known as Dīpavatī.

source: དེའི་ཚེ་རྒྱལ་པོའི་ཕོ་བྲང་མར་མེ་ལྡན་ན་རྒྱལ་པོ་མར་མེ་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ། དེའི་རིང་ལ་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་བ་དང་། རྩོད་པ་དང་། འཐབ་པ་ཞི་བ་དང་། འཁྲུག་པ་དང་། ནང་འཁྲུག་དང་། ཆོམ་རྐུན་དང་། ནད་དང་། མུ་གེ་མེད་པ་དང་། འབྲས་སཱ་ལུ་དང་། བུ་རམ་ཤིང་དང་། བ་ལང་དང་། མ་ཧེ་དང་ལྡན་པར་འདུག་སྟེ
en: During King Dīpa’s reign at Dīpavatī, the kingdom was prosperous, flourishing, happy, and well populated. The harvest was good, quarreling and arguments had ceased, there was no fighting or infighting, and there were no robbers, thieves, illness, or famine. Rice, sugarcane, cattle, and buffalo were plentiful. His was a reign in accord with the Dharma.

source: གནོད་པ་མེད་ཅིང་ཚེར་མ་དཀྲུགས་ལ་བུ་གཅིག་པ་སྡུག་པ་ལ་བྱ་བ་བཞིན་དུ་རྒྱལ་སྲིད་བྱེད་དོ། །
en: He ruled the kingdom gently and mercifully, as a parent cares for a beloved only child.

source: དེ་ནས་རྒྱལ་པོ་མར་མེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་གྲོང་ཁྱེར་གྱི་ནང་དུ་ཞབས་ས་ལ་རེག་པར་བྱ་བའི་ཕྱིར་སྤྱན་དྲངས་ནས།
en: “King Dīpa invited the totally and completely awakened Buddha Dīpaṃkara into the city so that his feet might touch the ground there.

source: རྒྱལ་པོ་མར་མེའི་འདབ་ན་རྒྱལ་པོ་ནོར་ཅན་གྱི་བུ་ཞེས་བྱ་བ་འདུག་པ་དེ་ལ་དེས་ཕོ་ཉ་བཏང་སྟེ།
en: In addition to King Dīpa, there was another king named Vāsava. King Dīpa sent him an envoy with a message that stated,

source: ངས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་གྲོང་ཁྱེར་གྱི་ནང་དུ་ཞབས་ས་ལ་རེག་པར་བྱ་བའི་ཕྱིར་སྤྱན་དྲངས་ཏེ།
en: ‘I am requesting the totally and completely awakened Buddha Dīpaṃkara to come to the city so that his feet might touch the ground here.

source: དེ་ལ་མཆོད་པ་བྱ་དགོས་ཀྱིས་ཤོག་ཅིག་ཅེས་སྤྲིང་ངོ་། །
en: Come, for we must worship him.’

source: དེའི་ཚེ་རྒྱལ་པོ་ནོར་ཅན་གྱི་བུས་ཀྱང་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་མཆོད་སྦྱིན་བྱས་ནས། མཆོད་སྦྱིན་གྱི་མཇུག་ཏུ་འདི་ལྟ་སྟེ།
en: “King Vāsava had been performing twelve years of ritual offerings, and at the end of them he was to set forth five magnificent offerings:

source: གསེར་གྱི་འཁར་བ་དང་། གསེར་གྱི་རིལ་བ་དང་། གསེར་གྱི་གཞོང་པ་དང་། རིན་པོ་ཆེ་སྣ་བཞིས་སྤྲས་པའི་མལ་ཁྲི་དང་། ཀཱརྵ་པ་ཎ་ལྔ་བརྒྱ་དང་། བུ་མོ་རྒྱན་ཐམས་ཅད་ཀྱིས་བཀླུབས་པ་སྟེ་རབ་ཏུ་སྦྱིན་པ་ཆེན་པོ་ལྔ་དངར་ཏོ། །
en: a golden staff, a small golden vase, a golden basin, a bed ornamented with four precious gems, five hundred gold coins, and a young woman wearing every type of adornment.

source: དེའི་ཚེ་ལྗོངས་གཞན་ཞིག་ན་བྲམ་ཟེའི་ཁྱེའུ་གཉིས་ཤིག་གནས་པ་དེ་གཉིས་ཀྱིས་མཁན་པོ་ལས་རིག་བྱེད་འདོན་པ་བསླབས་ཏེ།
en: “At the same time there were two young brahmins from another province who were learning Vedic recitation from their teachers.

source: ཆོས་ལུགས་ཀྱི་མཁན་པོ་ལ་ཡང་མཁན་པོའི་ཡོན་དབུལ་བ་དང་། སློབ་དཔོན་ལ་ཡང་སློབ་དཔོན་གྱི་ཡོན་དབུལ་དགོས་པར་ཤེས་ནས་སེམས་ཤིང་འདུག་གོ། །
en: They knew that they were expected to make offerings not only to the preceptor who instructed them in the Dharma, but also to their spiritual master as well, and they sat wondering how this might be done.

source: དེ་ནས་དེ་གཉིས་ཀྱིས་རྒྱལ་པོ་ནོར་ཅན་གྱི་བུས་མཆོད་སྦྱིན་གྱི་མཇུག་ཏུ་རབ་ཏུ་སྦྱིན་པ་ཆེན་པོ་ལྔ་བཤམས་ཏེ། བྲམ་ཟེ་གང་ཁ་ཏོན་རྫོགས་པར་ལོབས་པ་དེ་དབང་ངོ་ཞེས་ཟེར་བ་ཐོས་ནས་
en: “Then they heard that King Vāsava was to distribute five magnificent offerings at the end of his offering ritual, and that he would be granting them to the brahmin with the greatest mastery of recitation.

source: དེ་གཉིས་ཀྱིས་བསམས་པ། བླང་བར་བྱ་བ་དེ་ལེན་དུ་དེར་འདོང་ན་བདག་ཅག་གཉིས་ཀྱི་ནང་ན་མང་དུ་ཐོས་པའི་རབ་དང་ཁ་ཏོན་ལོབས་པའི་རབ་གང་ཡིན་པ་ངེས་པར་བྱའོ་
en: Because the two of them had studied and memorized so much, they thought that they might go and win the offerings, as well as find out for certain which of them was the best.

source: སྙམ་ནསརྒྱལ་པོ་ནོར་ཅན་གྱི་བུའི་གྲོང་ཁྱེར་ཆེན་པོ་ག་ལ་བ་དེར་ཆས་སོ། །
en: With all this in mind they set out for the city of King Vāsava.

source: རྒྱལ་པོ་དེ་ཡང་ལྷས་སྦྲན་ཏེ།
en: “The gods informed the king about this, saying,

source: བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་དང་བློ་གྲོས་ཞེས་བྱ་བ་གཉིས་འདིར་འོང་གིས།
en: ‘Two young brahmins named Sumati and Mati are coming here.
